CFD/OpenFoamTest/RiserMulti/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300; // 초기 온도 설정 (예: 300K)

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300; // 입력 온도 설정 (예: 300K)
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue;
        value           uniform 300; // 벽의 온도 설정 (예: 300K)
    }
}