CFD/OpenFoamTest/RiserMulti/constant/g
/*
 * gravity
 *
 * This file defines the gravitational acceleration vector.
 */
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions      [0 1 -2 0 0 0 0]; // 단위는 m/s²

value           (0 -9.81 0); // y 방향으로 중력 가속도 9.81 m/s²