CFD/OpenFoamTest/RiserMulti/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fluid phase properties
phases
{
    air
    {
        type            Newtonian;
        rho             1.225;        // Density (kg/m³)
        nu              1.5e-5;       // Kinematic viscosity (m²/s)
    }

    solid
    {
        type            granular;
        rho             2500;         // Density (kg/m³)
        nu              1e-5;         // Kinematic viscosity (m²/s)
    }
}

// Surface tension
sigma           0.07;                 // Surface tension coefficient (N/m)

// Other transport properties can be defined as needed
// For example, thermal conductivity, diffusion coefficients, etc.


// ************************************************************************* //
